#### ConnectorJointType Enumeration

---

|  |
| --- |
| See Also |

Connector joint type enum

Enum of connector joint type

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum ConnectorJointType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ConnectorJointType ``` |

| Visual C++ |
| --- |
| ``` public enum class ConnectorJointType ``` |

# Members

| Member name | Description |
| --- | --- |
| Undefined | Undefined connector joint type |
| Flanged | Flanged connector joint type |
| Welded | Welded connector joint type |
| Threaded | Threaded connector joint type |
| Grooved | Grooved connector joint type |
| Glued | Glued connector joint type |
| Soldered | Soldered connector joint type |

# See Also

Autodesk.Revit.DB Namespace